karis/app/controllers/main_controller.rb

  def index
  	@chords = Chord.search(params[:search])
---
SELECT "chords".* FROM "chords"