app/controllers/chords_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? ORDER BY "artists"."id" ASC LIMIT ?  [["name", "artist name"], ["LIMIT", 1]]
---
	def create
		#puts params
		artist_name = params[:chord][:artist_full_name] # we want to autocomplete this

		@artist = Artist.where(name: artist_name).first()