app/controllers/chords_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."first_name" = ? AND "artists"."last_name" = ? ORDER BY "artists"."id" ASC LIMIT ?  [["first_name", "Justin"], ["last_name", "Bieber"], ["LIMIT", 1]]
INSERT INTO "artists" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Justin"], ["last_name", "Bieber"], ["created_at", 2016-09-11 02:05:32 UTC], ["updated_at", 2016-09-11 02:05:32 UTC]]
SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 1]]
INSERT INTO "chords" ("title", "artist_id", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "upload this"], ["artist_id", 1], ["user_id", 1], ["content", "STFU"], ["created_at", 2016-09-11 02:05:33 UTC], ["updated_at", 2016-09-11 02:05:33 UTC]]
INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "James"], ["last_name", "Hong"], ["created_at", 2016-09-11 02:05:33 UTC], ["updated_at", 2016-09-11 02:05:33 UTC]]
---
	def create
		puts params
		artist_first_name, artist_last_name = get_split_artist_name(params[:chord][:artist_full_name]) # we want to autocomplete this

		@artist = Artist.where(first_name: artist_first_name, last_name: artist_last_name).first()

		if @artist.nil?
			@artist = Artist.create(first_name: artist_first_name, last_name: artist_last_name)
		end

		@user = User.take #eric jan

		@title = params[:chord][:title]
		@content = params[:chord][:content]

		@chord = Chord.new(title: @title, content: @content, artist: @artist, user: @user)
		if @chord.save

SELECT "chords".* FROM "chords" WHERE (title like '%Hello%')
---
	def index
		@chords = Chord.search(params[:search])

SELECT  "chords".* FROM "chords" WHERE "chords"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@chord = Chord.find(params[:id])